Revit 2024 API
GradientNoiseType Enumeration
 The enumerated type representing the permitted values for the asset property "GradientNoise" from the "Gradient" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum GradientNoiseType
Visual Basic
Public Enumeration GradientNoiseType
Visual C++
public enum class GradientNoiseType
Members
Member name | Description
Regular
Turbulence
Fractal
See Also
Autodesk.Revit.DB.Visual Namespace